/*
Реализация програмы для решения задачи по получению последовательности чисел, которую можно разложить в одно из известных вам сбалансированных деревьев.

Входные данные: некая последовательность чисел, вводимая пользователем с клавиатуры.

Выходные данные: набор чисел, входящих в заданную последовательность, собранных в такую последовательность, на основе которой можно сформировать сбалансированное дерево (АВЛ-, КЧ-, splay – дерево), без дополнительной балансировки. Либо можно вывести в консоль сформированное дерево.

Дополнительные условия:

1.       Дерево балансировки выбирается разработчиком. Т.е. алгоритм нахождения искомой последовательности может быть только для одного (необязательно) типа деревьев на ваш выбор.

2.       Программный код должен быть организован на основе объектно-ориентированной методологии программирования.

3.       Обязательно создание абстрактного класса узла, от которого произвести наследование для реализации класса узла определенного сбалансированного дерева.

4.       Функции перестроения деревьев, реализуются в классе-наследнике

5.       Методы для работы с деревьями: поиск, вставка и удаление узла по ключу, объявляются  в абстрактном классе.

6.       Алгоритм работы программы реализовать в исполняемом файле.

7. Придерживаться известных правил именования классов, функций, файлов. Каждый класс должен иметь свой заголовочный файл и файл реализации.

Дополнительные условия могут изменяться по договоренности с преподавателем.

В качестве ответа предоставить ссылку на репозиторий и приложить сформированнай exe-файл.
*/


// Сортировка по высотам дерева

#include "avltree.h"

int main(int argc, char** argv)
{   
    // Создаем АВЛ дерево
    AVLTree tree; 

    std::string inputString,
                stringKey;

    std::getline(std::cin, inputString);
    inputString += ' ';

    for (char c : inputString)
    {
        if (std::isdigit(c) || c == '-') stringKey += c;
        else
        {
            AVLNode* nodePtr {new AVLNode {std::stoi(stringKey)}};
            nodePtr->addNodeTo(&tree);
            stringKey.clear();
        }
    }

    tree.printTaskAnswer();
}

// cd C:\Users\user\Desktop\CPP\Mospolytech\BalancedTree
// g++ -o main.exe main.cpp avlnode.cpp avltree.cpp