/*
Реализация програмы для решения задачи по получению последовательности чисел, которую можно разложить в одно из известных вам сбалансированных деревьев без дополнительной балансировки.

Входные данные: некая последовательность чисел, вводимая пользователем с клавиатуры.

Выходные данные: набор чисел, входящих в заданную последовательность, собранных в такую последовательность, на основе которой можно сформировать сбалансированное дерево (АВЛ-, КЧ-, splay – дерево), без дополнительной балансировки.

Дополнительные условия:

1.       Дерево балансировки выбирается разработчиком. Т.е. алгоритм нахождения искомой последовательности может быть только для одного (необязательно) типа деревьев на ваш выбор.

2.       Программный код должен быть организован на основе объектно-ориентированной методологии программирования.

3.       Обязательно создание абстрактного класса узла, от которого произвести наследование для реализации класса узла определенного сбалансированного дерева.

4.       Функции перестроения деревьев, реализуются в классе-наследнике

5.       Методы для работы с деревьями: поиск, вставка и удаление узла по ключу, реализуются в абстрактном классе.

6.       Алгоритм работы программы реализовать в исполняемом файле.

7. Придерживаться известных правил именования классов, функций, файлов. Каждый класс должен иметь свой заголовочный файл и файл реализации.

Дополнительные условия могут изменяться по договоренности с преподавателем.

В качестве ответа предоставить ссылку на репозиторий и приложить сформированнай exe-файл.
*/

#include "avltree.h"

int main(int argc, char** argv)
{   
    AVLTree tree; 

    // Ключи для генерации узлов
    std::vector<int> keys {1,2,3,4,5,6};
    
    
    // Генерируем узлы и добавляем к дереву
    // for (size_t i = 0; i < keys.size(); i++)
    // {
    //     AVLNode* nodePtr {new AVLNode {keys.at(i)}};
    //     nodePtr->addNode(&tree);
    // }
    // tree.printAllInfo();
    // AVLNode::findNodeExact(&tree, 29);
    // tree.printAllInfo();
    
}

// g++ -o main.exe main.cpp node.cpp avltree.cpp abstractNode.cpp tree.cpp